org/article/aab_stdr_some-technical-document-reference.org
#+title: 项目答辩注意事项

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../sources/css/worg.css">
#+SETUPFILE: ../sources/org-template/common.template

need update!!!
 
* PPT

- 注意体现项目的大框架

- 讲述人讲述只是对PPT的补充，而不是对PPT的解释，应该做到能够看一眼便知
  道讲述的大体内容，细微的点只需稍加补充。

- 字体的大小， PPT颜色应以亮色为主

- 设计方案和设计合理性的凸显

- 如何操作的具体过程只需一笔带过

- 直接写出功能，不需要详细的介绍

- 需要重点突出项目的核心部分

- 软件展示必须使用流程图，二不能使用代码。

- PPT包含的信息量应该大，而不能大部分有讲述人讲述。

- 图要大，避免听者看不清


* 总结报告

** 硬件

*** 方案引出

需要有具体的需求（市场需求）来导出方案。比如需要单片机与人的交互，所以
选择按键。

*** 方案可行性分析

可行性分析主要有市场的购买的难易程度、方案设计的难易、设计人员的能力、
设计人员的熟悉程度等现实具体的因素分析。

*** 器件连接关系

一定要凸显出链接关系，必须具体到引脚的对应连接，如果是大框架可以表示各
组件的大体连接的示意图即可。

*** 参数的具体计算

每个电阻的取值、各个敏感的驱动电流（比如电机的驱动电流）、三极管的参数
计算等。


** 软件

*** 思路体现

软件应该是讲述软件的思路，然后再讲述各个部分。

*** 流程图

流程图需要标准（开始与结束--椭圆形，执行流程--矩形）。word推荐visio。

*** 中断

需要突出中断的具体流程意义。


** 调试

*** 效果对比

最好是有标准的对比实验，比如测室温，应该需要一个温度计。将温度记的示数
与产品显示温度比较。

*** 调试环境

使用的仪器和型号，软件平台。如果比较特殊需要加上天气、室温和时间等。

*** 数据偏差大

不应忽略或舍去较大的偏差数据，应该分析其出现的原因。


** 其他

*** 模块或子单元命名

命名不能太过随意，比如“主控电路”，显得低端、廉价。可以加上一些细节，如“电机测速系统
控制电路”。

*** 图与表的名字

名字应该在图的下面，表的上面。同时命名应该为1.x.x的形式。


*** 图片展示

如果给出的图片所要指出的位置过小，可以用额外的文字或图形在图上标明。


*** 图的叙述性文字

如果是图的叙述性文字，最好是在图的下面。更加直观。
