article/aab_stdr_some-technical-document-reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-08 Sat 21:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>项目答辩注意事项</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" type="text/css" href="../sources/css/worg.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">项目答辩注意事项</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9df52fd">1. PPT</a></li>
<li><a href="#orgd848c86">2. 总结报告</a>
<ul>
<li><a href="#orga41b925">2.1. 硬件</a>
<ul>
<li><a href="#org8e84364">2.1.1. 方案引出</a></li>
<li><a href="#orgdc7b321">2.1.2. 方案可行性分析</a></li>
<li><a href="#org385ccb6">2.1.3. 器件连接关系</a></li>
<li><a href="#orgae60d1e">2.1.4. 参数的具体计算</a></li>
</ul>
</li>
<li><a href="#org99ec56d">2.2. 软件</a>
<ul>
<li><a href="#org9dbf840">2.2.1. 思路体现</a></li>
<li><a href="#org73e0c9d">2.2.2. 流程图</a></li>
<li><a href="#org476fc81">2.2.3. 中断</a></li>
</ul>
</li>
<li><a href="#orgd6a5ca1">2.3. 调试</a>
<ul>
<li><a href="#org68d1d0c">2.3.1. 效果对比</a></li>
<li><a href="#org64815bc">2.3.2. 调试环境</a></li>
<li><a href="#org2ead1bd">2.3.3. 数据偏差大</a></li>
</ul>
</li>
<li><a href="#org8b44b6a">2.4. 其他</a>
<ul>
<li><a href="#org8425653">2.4.1. 模块或子单元命名</a></li>
<li><a href="#orgf5aa381">2.4.2. 图与表的名字</a></li>
<li><a href="#orgf23fe3d">2.4.3. 图片展示</a></li>
<li><a href="#org2ac744c">2.4.4. 图的叙述性文字</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9df52fd" class="outline-2">
<h2 id="org9df52fd"><span class="section-number-2">1.</span> PPT</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>注意体现项目的大框架</li>
<li>讲述人讲述只是对PPT的补充，而不是对PPT的解释，应该做到能够看一眼便知道
讲述的大体内容，细微的点只需稍加补充。</li>
<li>字体的大小， PPT颜色应以亮色为主</li>
<li>设计方案和设计合理性的凸显</li>
<li>如何操作的具体过程只需一笔带过</li>
<li>直接写出功能，不需要详细的介绍</li>
<li>需要重点突出项目的核心部分</li>
<li>软件展示必须使用流程图，二不能使用代码。</li>
<li>PPT包含的信息量应该大，而不能大部分有讲述人讲述。</li>
<li>图要大，避免听者看不清</li>
</ul>
</div>
</div>


<div id="outline-container-orgd848c86" class="outline-2">
<h2 id="orgd848c86"><span class="section-number-2">2.</span> 总结报告</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga41b925" class="outline-3">
<h3 id="orga41b925"><span class="section-number-3">2.1.</span> 硬件</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org8e84364" class="outline-4">
<h4 id="org8e84364"><span class="section-number-4">2.1.1.</span> 方案引出</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
需要有具体的需求（市场需求）来导出方案。比如需要单片机与人的交互，所以
选择按键。
</p>
</div>
</div>

<div id="outline-container-orgdc7b321" class="outline-4">
<h4 id="orgdc7b321"><span class="section-number-4">2.1.2.</span> 方案可行性分析</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
可行性分析主要有市场的购买的难易程度、方案设计的难易、设计人员的能力、
设计人员的熟悉程度等现实具体的因素分析。
</p>
</div>
</div>

<div id="outline-container-org385ccb6" class="outline-4">
<h4 id="org385ccb6"><span class="section-number-4">2.1.3.</span> 器件连接关系</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
一定要凸显出链接关系，必须具体到引脚的对应连接，如果是大框架可以表示各
组件的大体连接的示意图即可。
</p>
</div>
</div>

<div id="outline-container-orgae60d1e" class="outline-4">
<h4 id="orgae60d1e"><span class="section-number-4">2.1.4.</span> 参数的具体计算</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
每个电阻的取值、各个敏感的驱动电流（比如电机的驱动电流）、三极管的参数
计算等。
</p>
</div>
</div>
</div>

<div id="outline-container-org99ec56d" class="outline-3">
<h3 id="org99ec56d"><span class="section-number-3">2.2.</span> 软件</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org9dbf840" class="outline-4">
<h4 id="org9dbf840"><span class="section-number-4">2.2.1.</span> 思路体现</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
软件应该是讲述软件的思路，然后再讲述各个部分。
</p>
</div>
</div>

<div id="outline-container-org73e0c9d" class="outline-4">
<h4 id="org73e0c9d"><span class="section-number-4">2.2.2.</span> 流程图</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
流程图需要标准（开始与结束&#x2013;椭圆形，执行流程&#x2013;矩形）。word推荐visio。
</p>
</div>
</div>

<div id="outline-container-org476fc81" class="outline-4">
<h4 id="org476fc81"><span class="section-number-4">2.2.3.</span> 中断</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
需要突出中断的具体流程意义。
</p>
</div>
</div>
</div>

<div id="outline-container-orgd6a5ca1" class="outline-3">
<h3 id="orgd6a5ca1"><span class="section-number-3">2.3.</span> 调试</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org68d1d0c" class="outline-4">
<h4 id="org68d1d0c"><span class="section-number-4">2.3.1.</span> 效果对比</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
最好是有标准的对比实验，比如测室温，应该需要一个温度计。将温度记的示数
与产品显示温度比较。
</p>
</div>
</div>

<div id="outline-container-org64815bc" class="outline-4">
<h4 id="org64815bc"><span class="section-number-4">2.3.2.</span> 调试环境</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
使用的仪器和型号，软件平台。如果比较特殊需要加上天气、室温和时间等。
</p>
</div>
</div>

<div id="outline-container-org2ead1bd" class="outline-4">
<h4 id="org2ead1bd"><span class="section-number-4">2.3.3.</span> 数据偏差大</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
不应忽略或舍去较大的偏差数据，应该分析其出现的原因。
</p>
</div>
</div>
</div>

<div id="outline-container-org8b44b6a" class="outline-3">
<h3 id="org8b44b6a"><span class="section-number-3">2.4.</span> 其他</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org8425653" class="outline-4">
<h4 id="org8425653"><span class="section-number-4">2.4.1.</span> 模块或子单元命名</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
命名不能太过随意，比如“主控电路”，显得低端、廉价。可以加上一些细节，如“电机测速系统
控制电路”。
</p>
</div>
</div>

<div id="outline-container-orgf5aa381" class="outline-4">
<h4 id="orgf5aa381"><span class="section-number-4">2.4.2.</span> 图与表的名字</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
名字应该在图的下面，表的上面。同时命名应该为1.x.x的形式。
</p>
</div>
</div>

<div id="outline-container-orgf23fe3d" class="outline-4">
<h4 id="orgf23fe3d"><span class="section-number-4">2.4.3.</span> 图片展示</h4>
<div class="outline-text-4" id="text-2-4-3">
<p>
如果给出的图片所要指出的位置过小，可以用额外的文字或图形在图上标明。
</p>
</div>
</div>

<div id="outline-container-org2ac744c" class="outline-4">
<h4 id="org2ac744c"><span class="section-number-4">2.4.4.</span> 图的叙述性文字</h4>
<div class="outline-text-4" id="text-2-4-4">
<p>
如果是图的叙述性文字，最好是在图的下面。更加直观。
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-07-08 Sat 21:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
